## SQL and SQLite

SQL(Structured Query Language) is a standard language for managing and manipulating relational databases. SQLite is a self-contained, severless and zero-configuration database engine that is widely used for embedded database systems.

In [2]:
import sqlite3

In [3]:
##Connect to an SQLite database
connection=sqlite3.connect('example.db')
connection

In [4]:
cursor=connection.cursor()

In [18]:
##Create a table
cursor.execute('''
    Create Table if not exists Employees(
    id Integer Primary Key,
    name Text Not null,
    age Integer,
    department text  )     
''')
###the triple-quoted SQL string is getting passed into the cursor.execute() function, which means Python evaluates it as a string and sends it to SQLite.
##Commit the changes
connection.commit()

In [19]:
cursor.execute('''
   Select * from employees  
''')

In [20]:
##insert the data in sqlite table

cursor.execute('''
  Insert Into employees(name, age,department)
               values('Suraj',22, 'Data Science')
               ''')
cursor.execute('''
  Insert Into employees(name, age,department)
               values('Bob',26, 'Data Science')
               ''')
cursor.execute('''
  Insert Into employees(name, age,department)
               values('Charlie',25, 'Data Science')
               ''')

##commit the changes
connection.commit()

In [22]:
##Query the data from table
cursor.execute("Select * from employees")
rows=cursor.fetchall()

##print the queried data

for row in rows:
    print(row)

(1, 'Suraj', 22, 'Data Science')
(2, 'Suraj', 22, 'Data Science')
(3, 'Bob', 26, 'Data Science')
(4, 'Charlie', 25, 'Data Science')
(5, 'Suraj', 22, 'Data Science')
(6, 'Bob', 26, 'Data Science')
(7, 'Charlie', 25, 'Data Science')
(8, 'Suraj', 22, 'Data Science')
(9, 'Bob', 26, 'Data Science')
(10, 'Charlie', 25, 'Data Science')
(11, 'Suraj', 22, 'Data Science')
(12, 'Bob', 26, 'Data Science')
(13, 'Charlie', 25, 'Data Science')

In [ ]:
##Update the data in tge table

cursor.execute('''
UPDATE employees SET age =34 where name = "Bob"
''')
connection.commit()

In [24]:
cursor.execute("Select * from employees")
rows=cursor.fetchall()

##print the queried data

for row in rows:
    print(row)

(1, 'Suraj', 22, 'Data Science')
(2, 'Suraj', 22, 'Data Science')
(3, 'Bob', 34, 'Data Science')
(4, 'Charlie', 25, 'Data Science')
(5, 'Suraj', 22, 'Data Science')
(6, 'Bob', 34, 'Data Science')
(7, 'Charlie', 25, 'Data Science')
(8, 'Suraj', 22, 'Data Science')
(9, 'Bob', 34, 'Data Science')
(10, 'Charlie', 25, 'Data Science')
(11, 'Suraj', 22, 'Data Science')
(12, 'Bob', 34, 'Data Science')
(13, 'Charlie', 25, 'Data Science')

In [31]:
##Delete the data from the table
cursor.execute('''
Delete from employees where name = 'Bob'               
''')

In [32]:
cursor.execute("Select * from employees")
rows=cursor.fetchall()

##print the queried data

for row in rows:
    print(row)

(1, 'Suraj', 22, 'Data Science')
(2, 'Suraj', 22, 'Data Science')
(4, 'Charlie', 25, 'Data Science')
(5, 'Suraj', 22, 'Data Science')
(7, 'Charlie', 25, 'Data Science')
(8, 'Suraj', 22, 'Data Science')
(10, 'Charlie', 25, 'Data Science')
(11, 'Suraj', 22, 'Data Science')
(13, 'Charlie', 25, 'Data Science')

In [ ]:
##Working with sales data
#connect to an sqlite database
connection= sqlite3.connect('sales_data.db')
cursor=connection.cursor()

#create a table for sales data
cursor.execute('''
Create Table if not exists sales(
    id Integer Primary Key,
    date Text Not null,
    product Text Not null,
    sales Integer,
    region text  )         
''')

##Insert data into the sales table
sales_data=[
    ('2023-01-01','Product1',100,'North'),
    ('2023-01-02','Product2',150,'North'),
    ('2023-01-03','Product3',200,'East'),
    ('2023-01-04','Product4',500,'South'),
    ('2023-01-05','Product5',400,'West'),
    ('2023-01-06','Product6',300,'West'),
    
]
cursor.executemany('''   
Insert into sales(date,product,sales,region)
                   values(?,?,?,?)
                   ''',sales_data)
##instead of executemany i could use insertmany too

connection.commit()

In [5]:
cursor.execute("Select * from sales")
rows=cursor.fetchall()

##print the queried data

for row in rows:
    print(row)

(1, '2023-01-01', 'Product1', 100, 'North')
(2, '2023-01-02', 'Product2', 150, 'North')
(3, '2023-01-03', 'Product3', 200, 'East')
(4, '2023-01-04', 'Product4', 500, 'South')
(5, '2023-01-05', 'Product5', 400, 'West')
(6, '2023-01-06', 'Product6', 300, 'West')

In [6]:
##close the connection 
connection.close()